-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2015 年 10 月 12 日 02:49
-- 服务器版本: 5.5.24-log
-- PHP 版本: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `teacher_class_system`
--

-- --------------------------------------------------------

--
-- 表的结构 `teacher_class_computer_excellent`
--

CREATE TABLE IF NOT EXISTS `teacher_class_computer_excellent` (
  `insert_time` int(10) NOT NULL,
  `grade` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT '年级',
  `major` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `num` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_name` varchar(15) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_type` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_credit` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `op_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `pr_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `fl_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacher_name` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `addition` varchar(150) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`num`,`class_name`,`class_type`,`class_credit`,`class_time`,`op_time`,`pr_time`,`fl_time`,`teacher_name`,`addition`),
  KEY `insert_time` (`insert_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `teacher_class_computer_excellent`
--

INSERT INTO `teacher_class_computer_excellent` (`insert_time`, `grade`, `major`, `num`, `class_name`, `class_type`, `class_credit`, `class_time`, `op_time`, `pr_time`, `fl_time`, `teacher_name`, `addition`) VALUES
(1, '年级', '专业（卓越班）', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(2, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '18', '陈', '9'),
(3, '2014', '信息安全', '4', 'Android', '  实践选修', '4', '24', '', '', '', 'lkm', '1'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '9', '陈', '99'),
(4, '2014', '信息安全', '3', 'html', '  实践选修', '3', '24', '', '', '', 'lkm', '3'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '陈', '33'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '2'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '2'),
(5, '2014', '信息安全', '5', 'htpp', '  实践选修', '4', '24', '', '', '', 'lkm', '2'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '陈', '89'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '4'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '4'),
(6, '2014', '信息安全', '355', '松岛枫', '  实践选修', '42', '24', '', '', '', 'lkm', '4'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '陈', '20'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '5'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '5'),
(7, '2014', '信息安全', '4', '马二蛋黑粉会', '  实践选修', '200', '48', '', '', '', 'lkm', '5');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_class_computer_normal`
--

CREATE TABLE IF NOT EXISTS `teacher_class_computer_normal` (
  `insert_time` int(10) NOT NULL,
  `grade` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT '年级',
  `major` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `num` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_name` varchar(15) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_type` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_credit` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `op_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `pr_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `fl_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacher_name` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `addition` varchar(150) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`num`,`class_name`,`class_type`,`class_credit`,`class_time`,`op_time`,`pr_time`,`fl_time`,`teacher_name`,`addition`),
  KEY `insert_time` (`insert_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `teacher_class_computer_normal`
--

INSERT INTO `teacher_class_computer_normal` (`insert_time`, `grade`, `major`, `num`, `class_name`, `class_type`, `class_credit`, `class_time`, `op_time`, `pr_time`, `fl_time`, `teacher_name`, `addition`) VALUES
(1, '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(1, '年级', '专业（普通班）', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(2, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '2012', '计算机科学与技术', '23', 'jsp', '专业必修', '1', '23', '', '', '42350', 'lkm', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '10'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '1'),
(4, '2012', '计算机科学与技术', '34', 'java', '专业选修', '1', '43', '', '', '23-23', 'lkm', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '100'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '3'),
(4, '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术', '23', 'php', '  实践选修', '1', '54', '', '', '', 'lkm', '2'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '1000'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '2'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '2'),
(5, '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2012', '计算机科学与技术', '23', 'css', '专业必修', '1', '5657', '', '', '', 'lkm', '4'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '10000'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '4'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '4'),
(6, '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '2012', '计算机科学与技术', '12', '高数', '  实践选修', '1', '76', '', '', '', 'lkm', '5'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '0'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '5'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '马00', '5'),
(7, '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(8, '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）', '2', '32', '', '8', '', '', ''),
(10, '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）', '2', '32', '', '', '', '', ''),
(41, '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）', '2', '32', '', '', '', '', ''),
(48, '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '2014', '计算机类', '194', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '2015', '计算机类', '210', ' IEEE Micromous', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(66, '2015', '计算机类', '210', ' 问题求解与程序设计', '  专业选修', '2', '32', '', '', '2~12', '傅仰耿', '限60人选，排周一至周四的某个晚上3节'),
(67, '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `teacher_class_computer_operation`
--

CREATE TABLE IF NOT EXISTS `teacher_class_computer_operation` (
  `insert_time` int(10) NOT NULL,
  `grade` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT '年级',
  `major` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `num` varchar(100) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_name` varchar(15) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_type` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_credit` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `class_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `op_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `pr_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `fl_time` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacher_name` varchar(10) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `addition` varchar(150) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`num`,`class_name`,`class_type`,`class_credit`,`class_time`,`op_time`,`pr_time`,`fl_time`,`teacher_name`,`addition`),
  KEY `insert_time` (`insert_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `teacher_class_computer_operation`
--

INSERT INTO `teacher_class_computer_operation` (`insert_time`, `grade`, `major`, `num`, `class_name`, `class_type`, `class_credit`, `class_time`, `op_time`, `pr_time`, `fl_time`, `teacher_name`, `addition`) VALUES
(1, '年级', '专业（实验班）', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(2, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '1'),
(3, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '56', '', '马00', '1'),
(3, '2013', '软件学院', '23', '诗歌朗诵', '  实践选修', '4', '43', '', '', '', 'lkm', '1'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '3'),
(4, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '32', '', '马01', '3'),
(4, '2013', '软件学院', '3', '文言文', '  实践选修', '34', '343', '', '', '', 'lkm', '3'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '2'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '2'),
(5, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '12', '', '马02', '2'),
(5, '2013', '软件学院', '35', '唐诗', '  实践选修', '3', '53', '', '', '', 'lkm', '2'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '4'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '4'),
(6, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '32', '', '马03', '4'),
(6, '2013', '软件学院', '3', '宋词', '  实践选修', '23', '23', '', '', '', 'lkm', '4'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', 'cjd', '5'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '', '', '顺爷', '5'),
(7, '2012', '计算机科学与技术', '87', ' Internet技术与协议分', '  实践选修', '1', '24', '', '23', '', '马04', '5'),
(7, '2013', '软件学院', '5353', '中文', '  实践选修', '4', '23', '', '', '', 'lkm', '5');

-- --------------------------------------------------------

--
-- 表的结构 `user_manager`
--

CREATE TABLE IF NOT EXISTS `user_manager` (
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `work_number` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`work_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_manager`
--

INSERT INTO `user_manager` (`name`, `work_number`, `password`) VALUES
('余春艳', '04059', '04059'),
('张栋', '10044', '10044');

-- --------------------------------------------------------

--
-- 表的结构 `user_teacher`
--

CREATE TABLE IF NOT EXISTS `user_teacher` (
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `work_number` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`work_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teacher`
--

INSERT INTO `user_teacher` (`name`, `work_number`, `password`) VALUES
('马凛凛', '00001', '00001'),
('汪', '00002', '00002'),
('吕昆明', '00003', '00003'),
('陈俊达', '00004', '00004'),
('余春艳', '04059', '04059'),
('张栋', '10044', '10044');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
