-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2015 年 11 月 18 日 13:08
-- 服务器版本: 5.5.24-log
-- PHP 版本: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `teacher_class_system`
--

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_exc201401`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_exc201401` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_exc201401`
--

INSERT INTO `cb_tc_com_exc201401` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(7, '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '', ''),
(8, '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '', ''),
(9, '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_exc201501`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_exc201501` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_exc201501`
--

INSERT INTO `cb_tc_com_exc201501` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '张栋;张大栋;', ';不要周末上课;'),
(6, '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '张栋;', ';'),
(7, '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '张栋;张大栋;', ';;'),
(8, '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '张大栋;', ';'),
(9, '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_exc201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_exc201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_exc201502`
--

INSERT INTO `cb_tc_com_exc201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(7, '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '', ''),
(8, '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '', ''),
(9, '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_nor201401`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_nor201401` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_nor201401`
--

INSERT INTO `cb_tc_com_nor201401` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(8, '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_nor201501`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_nor201501` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_nor201501`
--

INSERT INTO `cb_tc_com_nor201501` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张栋;张大栋;张中栋;', ';;;'),
(6, '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张栋;张大栋;张中栋;', ';;;'),
(7, '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '张栋;', ';'),
(8, '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_nor201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_nor201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_nor201502`
--

INSERT INTO `cb_tc_com_nor201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张小栋;', '只白天上课;'),
(6, '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张小栋;', ';'),
(7, '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '张小栋;', ';'),
(8, '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_ope201401`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_ope201401` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_ope201401`
--

INSERT INTO `cb_tc_com_ope201401` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_ope201501`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_ope201501` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_ope201501`
--

INSERT INTO `cb_tc_com_ope201501` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张中栋;张大栋;', '周末不上课;;'),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋;张大栋;', ';周五不上课;'),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '张中栋;', ';'),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '张栋;张小栋;', '不要白天上课;;'),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '张栋;张小栋;', ';;'),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '张栋;张小栋;', ';;'),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_ope201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_ope201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_ope201502`
--

INSERT INTO `cb_tc_com_ope201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张中栋;张大栋;', ';;'),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋;张大栋;', ';没有要求;'),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '张大栋;', ';'),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '张中栋;', '周末不上课;'),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_inf_sec201401`
--

CREATE TABLE IF NOT EXISTS `cb_tc_inf_sec201401` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_inf_sec201401`
--

INSERT INTO `cb_tc_inf_sec201401` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '', ''),
(9, '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_inf_sec201501`
--

CREATE TABLE IF NOT EXISTS `cb_tc_inf_sec201501` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_inf_sec201501`
--

INSERT INTO `cb_tc_inf_sec201501` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '张中栋;', ';'),
(6, '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋;', ';'),
(7, '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '张中栋;', ';'),
(9, '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_inf_sec201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_inf_sec201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_inf_sec201502`
--

INSERT INTO `cb_tc_inf_sec201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '', ''),
(9, '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201401`
--

CREATE TABLE IF NOT EXISTS `cb_tc_math_nor201401` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201401`
--

INSERT INTO `cb_tc_math_nor201401` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201501`
--

CREATE TABLE IF NOT EXISTS `cb_tc_math_nor201501` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201501`
--

INSERT INTO `cb_tc_math_nor201501` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_math_nor201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201502`
--

INSERT INTO `cb_tc_math_nor201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `department_head_majors`
--

CREATE TABLE IF NOT EXISTS `department_head_majors` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `major` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`,`major`),
  KEY `work_number` (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `department_head_majors`
--

INSERT INTO `department_head_majors` (`workNumber`, `major`) VALUES
('00001', 'tc_com_exc'),
('00001', 'tc_com_nor'),
('00001', 'tc_com_ope'),
('00001', 'tc_inf_sec'),
('00001', 'tc_math_nor'),
('00001', 'tc_math_ope'),
('00001', 'tc_net_pro'),
('00001', 'tc_soft_pro'),
('00002', 'tc_com_ope'),
('00002', 'tc_inf_sec'),
('00002', 'tc_math_nor'),
('00002', 'tc_soft_pro');

-- --------------------------------------------------------

--
-- 表的结构 `task_info`
--

CREATE TABLE IF NOT EXISTS `task_info` (
  `relativeTable` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `year` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `semester` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `departmentDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `teacherDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `taskState` int(11) NOT NULL,
  PRIMARY KEY (`relativeTable`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `task_info`
--

INSERT INTO `task_info` (`relativeTable`, `year`, `semester`, `departmentDeadline`, `teacherDeadline`, `taskState`) VALUES
('tc_com_exc201401', '2014', '01', '20140219', '20140210', 2),
('tc_com_exc201501', '2015', '01', '20151219', '20151110', 1),
('tc_com_exc201502', '2015', '02', '20151219', '20151210', 0),
('tc_com_nor201401', '2014', '01', '20140219', '20140210', 2),
('tc_com_nor201501', '2015', '01', '20151219', '20151110', 1),
('tc_com_nor201502', '2015', '02', '20151219', '20151210', 0),
('tc_com_ope201401', '2014', '01', '20140219', '20140210', 2),
('tc_com_ope201501', '2015', '01', '20151219', '20151110', 1),
('tc_com_ope201502', '2015', '02', '20151219', '20151210', 0),
('tc_inf_sec201401', '2014', '01', '20141219', '20141210', 2),
('tc_inf_sec201501', '2015', '01', '20151219', '20151110', 1),
('tc_inf_sec201502', '2015', '02', '20151219', '20151210', 0),
('tc_math_nor201401', '2014', '01', '20141219', '20141210', 2),
('tc_math_nor201501', '2015', '01', '20151219', '20151110', 1),
('tc_math_nor201502', '2015', '02', '20151219', '20151210', 0);

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_exc201401`
--

CREATE TABLE IF NOT EXISTS `tc_com_exc201401` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_exc201401`
--

INSERT INTO `tc_com_exc201401` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(7, '', '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '', ''),
(8, '', '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '', ''),
(9, '', '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_exc201501`
--

CREATE TABLE IF NOT EXISTS `tc_com_exc201501` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_exc201501`
--

INSERT INTO `tc_com_exc201501` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '00001', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '张栋', ''),
(5, '10003', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '张大栋', '不要周末上课'),
(5, '10004', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '张中栋', ''),
(6, '', '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(6, '00001', '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '张栋', ''),
(7, '', '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '', ''),
(7, '00001', '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '张栋', ''),
(7, '10003', '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '张大栋', ''),
(8, '', '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '', ''),
(8, '10003', '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '张大栋', ''),
(9, '', '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_exc201502`
--

CREATE TABLE IF NOT EXISTS `tc_com_exc201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_exc201502`
--

INSERT INTO `tc_com_exc201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（卓越班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业设计(卓越)', '  毕业设计', '12', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（卓越班）', '73', ' 毕业实习（卓越）', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（卓越班）', '96', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(7, '', '2013', '计算机科学与技术（卓越班）', '96', ' Web程序设计', '  专业方向（限选）4', '2', '32', '', '8', '', '', ''),
(8, '', '2013', '计算机科学与技术（卓越班）', '96', ' 单片机及应用', '  学科专业选修', '2', '32', '', '16', '', '', ''),
(9, '', '2013', '计算机科学与技术（卓越班）', '96', ' 电子商务技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（卓越班）', '96', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（卓越班）', '96', ' 分布式数据库A', '  学科专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机多核技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机仿真技术', '  学科专业选修', '2', '32', '12', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机外部设备', '  学科专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（卓越班）', '96', ' 计算机系统集成', '  学科专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（卓越班）', '96', ' 密码理论', '  学科专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（卓越班）', '96', ' 模式识别', '  学科专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（卓越班）', '96', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人工神经网络', '  学科专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（卓越班）', '96', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件可靠性', '  学科专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件平台与中间件技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（卓越班）', '96', ' 软件项目管理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（卓越班）', '96', ' 图象处理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网格计算', '  学科专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络管理实践', '  实践选修', '3', '72', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（卓越班）', '96', ' 网络信息安全', '  专业方向（限选）4', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（卓越班）', '96', ' 下一代互联网技术', '  学科专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（卓越班）', '96', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术（卓越班）', '96', ' 虚拟现实', '  学科专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术（卓越班）', '96', ' 应用服务器原理', '  学科专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术（卓越班）', '96', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术（卓越班）', '96', ' 运筹学', '  学科专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术（卓越班）', '96', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_nor201401`
--

CREATE TABLE IF NOT EXISTS `tc_com_nor201401` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_nor201401`
--

INSERT INTO `tc_com_nor201401` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '', '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '', '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '', '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '', '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '', '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '', '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '', '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '', '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '', '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '', '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '', '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '', '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '', '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '', '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '', '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '', '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '', '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '', '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '', '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '', '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '', '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '', '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '', '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '', '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '', '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '', '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '', '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '', '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '', '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '', '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_nor201501`
--

CREATE TABLE IF NOT EXISTS `tc_com_nor201501` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_nor201501`
--

INSERT INTO `tc_com_nor201501` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '00001', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张栋', ''),
(5, '10003', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张大栋', ''),
(5, '10004', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张中栋', ''),
(6, '', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(6, '00001', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张栋', ''),
(6, '10003', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张大栋', ''),
(6, '10004', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张中栋', ''),
(7, '', '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(7, '00001', '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '张栋', ''),
(8, '', '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '', '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '', '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '', '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '', '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '', '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '', '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '', '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '', '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '', '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '', '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '', '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '', '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '', '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '', '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '', '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '', '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '', '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '', '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '', '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '', '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '', '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '', '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '', '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '', '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '', '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '', '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '', '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '', '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '', '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_nor201502`
--

CREATE TABLE IF NOT EXISTS `tc_com_nor201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_nor201502`
--

INSERT INTO `tc_com_nor201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术', '88', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '10005', '2012', '计算机科学与技术', '88', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张小栋', '只白天上课'),
(6, '', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '', ''),
(6, '10005', '2013', '计算机科学与技术', '62', ' Android应用开发', '  专业选修', '2', '32', '', '', '', '张小栋', ''),
(7, '', '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '', ''),
(7, '10005', '2013', '计算机科学与技术', '62', ' Android应用开发实训', '  实践选修', '1.5', '36', '', '', '', '张小栋', ''),
(8, '', '2013', '计算机科学与技术', '62', ' CAD课程设计', '  实践选修', '1', '24', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术', '62', ' Web程序设计', '  专业方向（限选）2', '2', '32', '', '8', '', '', ''),
(10, '', '2013', '计算机科学与技术', '62', ' Web数据集成系统', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术', '62', ' 标准电子文档技术PDF的研究与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术', '62', ' 程序设计实践', '  实践选修', '1', '24', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术', '62', ' 单片机及应用', '  专业选修', '2', '32', '', '16', '', '', ''),
(14, '', '2013', '计算机科学与技术', '62', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术', '62', ' 多媒体技术与应用', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术', '62', ' 多媒体综合实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术', '62', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术', '62', ' 高级人工智能', '  专业选修', '1', '16', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术', '62', ' 计算机动画与游戏设计基础', '  专业方向（限选）3', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术', '62', ' 计算机多核技术', '  专业选修', '2', '32', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术', '62', ' 计算机仿真技术', '  专业选修', '2', '32', '12', '', '', '', ''),
(22, '', '2013', '计算机科学与技术', '62', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术', '62', ' 计算机外部设备', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术', '62', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术', '62', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术', '62', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术', '62', ' 面向商业智能的软件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术', '62', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术', '62', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术', '62', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术', '62', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术', '62', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2013', '计算机科学与技术', '62', ' 数据仓库', '  专业选修', '2', '32', '', '', '', '', ''),
(35, '', '2013', '计算机科学与技术', '62', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(36, '', '2013', '计算机科学与技术', '62', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(37, '', '2013', '计算机科学与技术', '62', ' 网络工程应用开发技术', '  专业选修', '2', '32', '', '', '', '', ''),
(38, '', '2013', '计算机科学与技术', '62', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2013', '计算机科学与技术', '62', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(40, '', '2013', '计算机科学与技术', '62', ' 网络信息安全', '  专业方向（限选）1', '2', '32', '', '', '', '', ''),
(41, '', '2013', '计算机科学与技术', '62', ' 物联网技术概论', '  专业选修', '2', '32', '', '', '', '', ''),
(42, '', '2013', '计算机科学与技术', '62', ' 下一代互联网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(43, '', '2013', '计算机科学与技术', '62', ' 信息系统设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(44, '', '2013', '计算机科学与技术', '62', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(45, '', '2013', '计算机科学与技术', '62', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(46, '', '2013', '计算机科学与技术', '62', ' 运筹学', '  专业选修', '2', '32', '', '', '', '', ''),
(47, '', '2013', '计算机科学与技术', '62', ' 智能管理系统', '  专业方向（限选）2', '2', '32', '', '', '', '', ''),
(48, '', '2013', '计算机科学与技术', '62', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(49, '', '2013', '计算机科学与技术', '62', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(50, '', '2014', '计算机类', '194', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(51, '', '2014', '计算机类', '194', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(52, '', '2014', '计算机类', '194', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(53, '', '2014', '计算机类', '194', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(54, '', '2014', '计算机类', '194', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(55, '', '2014', '计算机类', '194', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(56, '', '2014', '计算机类', '194', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(57, '', '2014', '计算机类', '194', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(58, '', '2014', '计算机类', '194', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(59, '', '2014', '计算机类', '194', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(60, '', '2014', '计算机类', '194', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(61, '', '2015', '计算机类', '210', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(62, '', '2015', '计算机类', '210', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(63, '', '2015', '计算机类', '210', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(64, '', '2015', '计算机类', '210', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(65, '', '2015', '计算机类', '210', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_ope201401`
--

CREATE TABLE IF NOT EXISTS `tc_com_ope201401` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_ope201401`
--

INSERT INTO `tc_com_ope201401` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_ope201501`
--

CREATE TABLE IF NOT EXISTS `tc_com_ope201501` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_ope201501`
--

INSERT INTO `tc_com_ope201501` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '10003', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张大栋', ''),
(5, '10004', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张中栋', '周末不上课'),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(6, '10003', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张大栋', '周五不上课'),
(6, '10004', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '10004', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '张中栋', ''),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '张栋', '不要白天上课'),
(9, '10005', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '张小栋', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(11, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '张栋', ''),
(11, '10005', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '张小栋', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(12, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '张栋', ''),
(12, '10005', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '张小栋', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_ope201502`
--

CREATE TABLE IF NOT EXISTS `tc_com_ope201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_ope201502`
--

INSERT INTO `tc_com_ope201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '10003', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张大栋', ''),
(5, '10004', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '张中栋', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(6, '10003', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张大栋', '没有要求'),
(6, '10004', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(7, '10003', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '张大栋', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '10004', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '张中栋', '周末不上课'),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_inf_sec201401`
--

CREATE TABLE IF NOT EXISTS `tc_inf_sec201401` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_inf_sec201401`
--

INSERT INTO `tc_inf_sec201401` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '', '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '', ''),
(9, '', '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '', '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '', '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '', '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '', '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '', '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '', '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '', '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '', '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '', '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '', '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '', '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '', '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '', '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '', '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '', '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '', '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '', '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '', '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_inf_sec201501`
--

CREATE TABLE IF NOT EXISTS `tc_inf_sec201501` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_inf_sec201501`
--

INSERT INTO `tc_inf_sec201501` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '', ''),
(5, '10004', '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '张中栋', ''),
(6, '', '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(6, '10004', '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '张中栋', ''),
(7, '', '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '', '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '', ''),
(8, '10004', '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '张中栋', ''),
(9, '', '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '', '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '', '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '', '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '', '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '', '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '', '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '', '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '', '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '', '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '', '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '', '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '', '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '', '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '', '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '', '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '', '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '', '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '', '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_inf_sec201502`
--

CREATE TABLE IF NOT EXISTS `tc_inf_sec201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_inf_sec201502`
--

INSERT INTO `tc_inf_sec201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期信息安全专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '信息安全', '40', ' 毕业设计(论文)(信息安全)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '信息安全', '40', ' 毕业实习(信息安全)', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '信息安全', '37', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '信息安全', '37', ' 内容安全与计算机取证', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(8, '', '2013', '信息安全', '37', ' 内容安全与信息隐藏实验', '  实践环节', '1', '24', '', '', '', '', ''),
(9, '', '2013', '信息安全', '37', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '信息安全', '37', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(11, '', '2013', '信息安全', '37', ' 无线网络安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(12, '', '2013', '信息安全', '37', ' 信息安全工程', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '信息安全', '37', ' 信息安全科技实训 1', '  实践环节', '1', '24', '', '', '', '', ''),
(14, '', '2013', '信息安全', '37', ' 信息隐藏技术', '  专业必修（限选）', '2.5', '40', '', '', '', '', ''),
(15, '', '2013', '信息安全', '37', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(16, '', '2013', '信息安全', '37', ' 云计算与物联网安全', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(17, '', '2013', '信息安全', '37', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2014', '信息安全', '39', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(19, '', '2014', '信息安全', '39', ' 汇编语言程序设计', '  实践选修', '2', '48', '', '', '', '', ''),
(20, '', '2014', '信息安全', '39', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(21, '', '2014', '信息安全', '39', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(22, '', '2014', '信息安全', '39', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(23, '', '2014', '信息安全', '39', ' 数据库系统原理', '  专业必修（限选）', '3.5', '56', '', '', '', '', ''),
(24, '', '2014', '信息安全', '39', ' 数据库应用实践', '  实践选修', '2', '48', '', '', '', '', ''),
(25, '', '2014', '信息安全', '39', ' 数据通信与计算机网络B（外文）', '  学科必修', '3.5', '56', '', '', '', '', ''),
(26, '', '2014', '信息安全', '39', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(27, '', '2015', '信息安全', '50', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(28, '', '2015', '信息安全', '50', ' 电子线路综合实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(29, '', '2015', '信息安全', '50', ' 基础电路与电子学', '  学科必修', '5', '80', '', '', '', '', ''),
(30, '', '2015', '信息安全', '50', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', ''),
(31, '', '2015', '信息安全', '50', ' 信息安全法律法规', '  专业必修（限选）', '1', '16', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201401`
--

CREATE TABLE IF NOT EXISTS `tc_math_nor201401` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201401`
--

INSERT INTO `tc_math_nor201401` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201501`
--

CREATE TABLE IF NOT EXISTS `tc_math_nor201501` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201501`
--

INSERT INTO `tc_math_nor201501` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201502`
--

CREATE TABLE IF NOT EXISTS `tc_math_nor201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201502`
--

INSERT INTO `tc_math_nor201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '', '2015学年下学期数学类 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '数学与应用数学', '43', ' 毕业设计(论文)(数学与应用数学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(5, '', '2012', '数学与应用数学', '43', ' 毕业实习(数学与应用数学)', '  毕业实习', '4', '', '', '', '', '', ''),
(6, '', '2012', '信息与计算科学', '50', ' 毕业设计(论文)(信息与计算科学)', '  毕业设计', '12.5', '', '', '', '', '', ''),
(7, '', '2012', '信息与计算科学', '50', ' 毕业实习(信息与计算科学)', '  毕业实习', '4', '', '', '', '', '', ''),
(8, '', '2013', '数学与应用数学', '45', ' 博弈论', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(9, '', '2013', '数学与应用数学', '45', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(10, '', '2013', '数学与应用数学', '45', ' 多元统计分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(11, '', '2013', '数学与应用数学', '45', ' 计量经济学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(12, '', '2013', '数学与应用数学', '45', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(13, '', '2013', '数学与应用数学', '45', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(14, '', '2013', '数学与应用数学', '45', ' 控制论基础', '  专业选修', '32', '2', '', '', '', '', ''),
(15, '', '2013', '数学与应用数学', '45', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(16, '', '2013', '数学与应用数学', '45', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(17, '', '2013', '数学与应用数学', '45', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(18, '', '2013', '数学与应用数学', '45', ' 生物数学', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(19, '', '2013', '数学与应用数学', '45', ' 时间序列分析', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(20, '', '2013', '数学与应用数学', '45', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(21, '', '2013', '数学与应用数学', '45', ' 微分几何', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(22, '', '2013', '数学与应用数学', '45', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(23, '', '2013', '数学与应用数学', '45', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(24, '', '2013', '信息与计算科学', '44', ' 大型数据库系统', '  专业选修', '3', '48', '', '16', '', '', ''),
(25, '', '2013', '信息与计算科学', '44', ' 多元统计分析', '  专业选修', '3', '48', '', '', '', '', ''),
(26, '', '2013', '信息与计算科学', '44', ' 计算机动画技术', '  实践环节', '2', '48', '', '', '', '', ''),
(27, '', '2013', '信息与计算科学', '44', ' 计算几何', '  专业选修', '3', '48', '', '', '', '', ''),
(28, '', '2013', '信息与计算科学', '44', ' 控制论基础', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '信息与计算科学', '44', ' 模糊数学', '  专业选修', '3', '48', '', '', '', '', ''),
(30, '', '2013', '信息与计算科学', '44', ' 软件工程B', '  专业选修', '3', '48', '', '16', '', '', ''),
(31, '', '2013', '信息与计算科学', '44', ' 软件工程实习', '  实践选修', '2', '48', '', '', '', '', ''),
(32, '', '2013', '信息与计算科学', '44', ' 算法设计与分析', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(33, '', '2013', '信息与计算科学', '44', ' 图论及其应用', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(34, '', '2013', '信息与计算科学', '44', ' 图像处理基础', '  专业必修（限选）', '3', '48', '', '8', '', '', ''),
(35, '', '2013', '信息与计算科学', '44', ' 网络编程', '  专业选修', '3', '48', '', '16', '', '', ''),
(36, '', '2013', '信息与计算科学', '44', ' 微分方程数值解', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(37, '', '2013', '信息与计算科学', '44', ' 小波变换及其应用', '  专业选修', '3', '48', '', '', '', '', ''),
(38, '', '2013', '信息与计算科学', '44', ' 遥感信息处理', '  专业选修', '3', '48', '', '16', '', '', ''),
(39, '', '2013', '信息与计算科学', '44', ' 组合优化', '  专业必修（限选）', '3', '48', '', '', '', '', ''),
(40, '', '2014', '数学类', '94', ' 概率统计', '  学科必修', '4.5', '72', '', '', '', '', ''),
(41, '', '2014', '数学类', '94', ' 实变函数', '  学科必修', '4', '64', '', '', '', '', ''),
(42, '', '2014', '数学类', '94', ' 数学建模训练', '  实践选修', '2', '48', '', '', '', '', ''),
(43, '', '2014', '数学类', '94', ' 数学模型', '  学科必修', '3', '48', '', '', '', '', ''),
(44, '', '2014', '数学类', '94', ' 数学软件与数学实验', '  实践环节', '2', '48', '', '', '', '', ''),
(45, '', '2014', '数学类', '94', ' 数值计算方法', '  学科必修', '3', '48', '', '16', '', '', ''),
(46, '', '2014', '数学类', '94', ' 运筹学', '  学科必修', '3', '48', '', '', '', '', ''),
(47, '', '2015', '数学类', '73', ' C语言', '  公共必修', '4', '64', '', '32', '', '', ''),
(48, '', '2015', '数学类', '73', ' office软件应用实训', '  实践选修', '1', '24', '', '', '', '', ''),
(49, '', '2015', '数学类', '73', ' 高等代数(下）', '  学科必修', '6', '96', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `user_department_head`
--

CREATE TABLE IF NOT EXISTS `user_department_head` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_department_head`
--

INSERT INTO `user_department_head` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`) VALUES
('00001', '00001', '栋栋', '女', '15692546', '信息安全', '155469415', '2165@qq.com'),
('00002', '00002', '张大栋', '男', '15692546', '计算机', '155469415', '2165@qq.com');

-- --------------------------------------------------------

--
-- 表的结构 `user_teacher`
--

CREATE TABLE IF NOT EXISTS `user_teacher` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teacher`
--

INSERT INTO `user_teacher` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`) VALUES
('00001', '00001', '张栋', '男', '18990125', '计算机', '18110119120', '18110119120@163.com'),
('10003', '10003', '张大栋', '', '', '', '', ''),
('10004', '10004', '张中栋', '', '', '', '', ''),
('10005', '10005', '张小栋', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `user_teaching_office`
--

CREATE TABLE IF NOT EXISTS `user_teaching_office` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teaching_office`
--

INSERT INTO `user_teaching_office` (`workNumber`, `password`, `name`, `telephone`, `email`) VALUES
('00001', '00001', 'zd', '18641545612', '1545615hud@qq.com');

--
-- 限制导出的表
--

--
-- 限制表 `department_head_majors`
--
ALTER TABLE `department_head_majors`
  ADD CONSTRAINT `department_head_majors_ibfk_1` FOREIGN KEY (`workNumber`) REFERENCES `user_department_head` (`workNumber`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
