-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2015 年 11 月 17 日 10:30
-- 服务器版本: 5.5.24-log
-- PHP 版本: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `teacher_class_system`
--

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_com_ope201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_com_ope201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_com_ope201502`
--

INSERT INTO `cb_tc_com_ope201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '弯毓顺是弯的;'),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '弯毓顺;', '对的;'),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_math_nor201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_math_nor201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_math_nor201502`
--

INSERT INTO `cb_tc_math_nor201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '弯毓顺;', '11111111111111111111111111111111111111111111fsjdhfjlskdjflskdjffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff;'),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '33333333333333333333333333333333333333333333333333333333333333333333333;'),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '4555555555555555555555555555555555555555555555555555;'),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `cb_tc_soft_pro201502`
--

CREATE TABLE IF NOT EXISTS `cb_tc_soft_pro201502` (
  `insertTime` int(10) NOT NULL,
  `grade` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `cb_tc_soft_pro201502`
--

INSERT INTO `cb_tc_soft_pro201502` (`insertTime`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(1, '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '弯毓顺;', ';'),
(51, '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '弯毓顺;', ';');

-- --------------------------------------------------------

--
-- 表的结构 `department_head_majors`
--

CREATE TABLE IF NOT EXISTS `department_head_majors` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `major` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`,`major`),
  KEY `work_number` (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `department_head_majors`
--

INSERT INTO `department_head_majors` (`workNumber`, `major`) VALUES
('110120', '网络工程专业'),
('110120', '计算机（卓越班)'),
('110120', '计算机（实验班）'),
('110120', '软件工程');

-- --------------------------------------------------------

--
-- 表的结构 `task_info`
--

CREATE TABLE IF NOT EXISTS `task_info` (
  `relativeTable` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `year` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `semester` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `departmentDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `teacherDeadline` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `taskState` int(11) NOT NULL,
  PRIMARY KEY (`relativeTable`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `task_info`
--

INSERT INTO `task_info` (`relativeTable`, `year`, `semester`, `departmentDeadline`, `teacherDeadline`, `taskState`) VALUES
('tc_com_ope201502', '2015', '02', '20151119', '20151118', 0),
('tc_math_nor201502', '2015', '02', '20151119', '20151118', 0),
('tc_soft_pro201502', '2015', '02', '20151119', '20151118', 0);

-- --------------------------------------------------------

--
-- 表的结构 `tc_com_ope201502`
--

CREATE TABLE IF NOT EXISTS `tc_com_ope201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_com_ope201502`
--

INSERT INTO `tc_com_ope201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(0, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '弯毓顺;', '对的'),
(0, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '弯毓顺是弯的'),
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_math_nor201502`
--

CREATE TABLE IF NOT EXISTS `tc_math_nor201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_math_nor201502`
--

INSERT INTO `tc_math_nor201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(0, '00001', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '弯毓顺;', '11111111111111111111111111111111111111111111fsjdhfjlskdjflskdjffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff'),
(0, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '33333333333333333333333333333333333333333333333333333333333333333333333'),
(0, '00001', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '弯毓顺;', '4555555555555555555555555555555555555555555555555555'),
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `tc_soft_pro201502`
--

CREATE TABLE IF NOT EXISTS `tc_soft_pro201502` (
  `insertTime` int(10) NOT NULL,
  `workNumber` varchar(40) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `grade` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `major` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `people` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseName` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseType` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseCredit` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `courseHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `practiceHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `onMachineHour` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `timePeriod` varchar(30) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `teacherName` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(200) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`workNumber`,`grade`,`major`,`people`,`courseName`,`courseType`,`courseCredit`,`courseHour`,`practiceHour`,`onMachineHour`,`timePeriod`,`teacherName`,`remark`),
  KEY `insertTime` (`insertTime`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `tc_soft_pro201502`
--

INSERT INTO `tc_soft_pro201502` (`insertTime`, `workNumber`, `grade`, `major`, `people`, `courseName`, `courseType`, `courseCredit`, `courseHour`, `practiceHour`, `onMachineHour`, `timePeriod`, `teacherName`, `remark`) VALUES
(0, '00001', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '弯毓顺;', ''),
(0, '00001', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '弯毓顺;', ''),
(1, '', '2015学年下学期计算机科学与技术（实验班）专业 开课计划书', '', '', '', '', '', '', '', '', '', '', ''),
(2, '', '年级', '专业', '专业人数', '课程名称', '选修类型', '学分', '学时', '实验', '上机', '起讫周序', '任课教师', '备注'),
(3, '', '', '', '', '', '', '', '', '学时', '学时', '', '', ''),
(4, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业设计(论文)', '  毕业设计', '15', '', '', '', '', '', ''),
(5, '', '2012', '计算机科学与技术（实验班）', '62', ' 毕业实习', '  毕业实习', '3', '', '', '', '', '', ''),
(6, '', '2013', '计算机科学与技术（实验班）', '61', ' Web程序设计', '  专业选修', '2', '32', '', '8', '', '', ''),
(7, '', '2013', '计算机科学与技术（实验班）', '61', ' 单片机及应用', '  专业选修', '2', '32', '', '', '', '', ''),
(8, '', '2013', '计算机科学与技术（实验班）', '61', ' 电子商务技术', '  专业选修', '2', '32', '', '', '', '', ''),
(9, '', '2013', '计算机科学与技术（实验班）', '61', ' 多核和并行处理技术', '  专业选修', '2', '32', '', '', '', '', ''),
(10, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(11, '', '2013', '计算机科学与技术（实验班）', '61', ' 多媒体综合实验', '  实践选修', '1', '', '', '', '', '', ''),
(12, '', '2013', '计算机科学与技术（实验班）', '61', ' 分布式数据库A', '  专业选修', '2', '32', '', '', '', '', ''),
(13, '', '2013', '计算机科学与技术（实验班）', '61', ' 高级人工智能', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(14, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机视觉', '  专业选修', '2', '32', '', '', '', '', ''),
(15, '', '2013', '计算机科学与技术（实验班）', '61', ' 计算机网络和计算机系统性能评估', '  专业选修', '2', '32', '', '', '', '', ''),
(16, '', '2013', '计算机科学与技术（实验班）', '61', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(17, '', '2013', '计算机科学与技术（实验班）', '61', ' 密码理论', '  专业选修', '2', '32', '', '', '', '', ''),
(18, '', '2013', '计算机科学与技术（实验班）', '61', ' 模式识别', '  专业选修', '2', '32', '', '', '', '', ''),
(19, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统', '  专业选修', '2', '32', '', '', '', '', ''),
(20, '', '2013', '计算机科学与技术（实验班）', '61', ' 嵌入式系统实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(21, '', '2013', '计算机科学与技术（实验班）', '61', ' 人工神经网络', '  专业选修', '2', '32', '', '', '', '', ''),
(22, '', '2013', '计算机科学与技术（实验班）', '61', ' 人机交互技术', '  专业选修', '2', '32', '', '', '', '', ''),
(23, '', '2013', '计算机科学与技术（实验班）', '61', ' 软件平台与中间件技术', '  专业选修', '2', '32', '', '', '', '', ''),
(24, '', '2013', '计算机科学与技术（实验班）', '61', ' 图象处理', '  专业选修', '2', '32', '', '', '', '', ''),
(25, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络多媒体技术', '  专业选修', '2', '32', '', '', '', '', ''),
(26, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络管理实验', '  实践选修', '1', '24', '', '', '', '', ''),
(27, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络互连技术与应用', '  专业选修', '2', '32', '', '', '', '', ''),
(28, '', '2013', '计算机科学与技术（实验班）', '61', ' 网络信息安全', '  专业选修', '2', '32', '', '', '', '', ''),
(29, '', '2013', '计算机科学与技术（实验班）', '61', ' 移动通信网络', '  专业选修', '2', '32', '', '', '', '', ''),
(30, '', '2013', '计算机科学与技术（实验班）', '61', ' 应用服务器原理', '  专业选修', '2', '32', '', '', '', '', ''),
(31, '', '2013', '计算机科学与技术（实验班）', '61', ' 硬件设备组网与配置实验', '  实践选修', '1.5', '36', '', '', '', '', ''),
(32, '', '2013', '计算机科学与技术（实验班）', '61', ' 智能系统综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(33, '', '2013', '计算机科学与技术（实验班）', '61', ' 组网技术', '  专业选修', '2', '32', '', '', '', '', ''),
(34, '', '2014', '计算机科学与技术（实验班）', '72', ' Internet技术与协议分析实验', '  实践选修', '1', '24', '', '', '', '', ''),
(35, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机操作系统', '  学科必修', '4', '64', '', '18', '', '', ''),
(36, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理A', '  学科必修', '4', '64', '', '', '', '', ''),
(37, '', '2014', '计算机科学与技术（实验班）', '72', ' 计算机组成原理实践', '  实践选修', '1.5', '36', '', '', '', '', ''),
(38, '', '2014', '计算机科学与技术（实验班）', '72', ' 局域网技术实验', '  实践选修', '1', '24', '', '', '', '', ''),
(39, '', '2014', '计算机科学与技术（实验班）', '72', ' 可计算性理论', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(40, '', '2014', '计算机科学与技术（实验班）', '72', ' 嵌入式技术与应用展望系列讲座(企业开课)', '  专业选修', '1.5', '24', '', '', '', '', ''),
(41, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库系统原理', '  学科必修', '3.5', '56', '', '', '', '', ''),
(42, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据库应用实践', '  实践环节', '2', '48', '', '', '', '', ''),
(43, '', '2014', '计算机科学与技术（实验班）', '72', ' 数据通信与计算机网络A', '  学科必修', '4', '64', '', '', '', '', ''),
(44, '', '2014', '计算机科学与技术（实验班）', '72', ' 数学建模', '  专业必修（限选）', '2', '32', '', '', '', '', ''),
(45, '', '2014', '计算机科学与技术（实验班）', '72', ' 专家系列讲座', '  专业选修', '1', '16', '', '', '', '', ''),
(46, '', '2015', '计算机科学与技术（实验班）', '70', ' IEEE Micromouse 原理与实践A（企业开课）', '  专业选修', '2', '32', '16', '', '', '', ''),
(47, '', '2015', '计算机科学与技术（实验班）', '70', ' 程序设计语言综合设计', '  实践选修', '1.5', '36', '', '', '', '', ''),
(48, '', '2015', '计算机科学与技术（实验班）', '70', ' 电子线路综合实验', '  实践环节', '1.5', '36', '', '', '', '', ''),
(49, '', '2015', '计算机科学与技术（实验班）', '70', ' 基础电路与电子学（实验班）', '  学科必修', '3', '48', '', '', '', '', ''),
(50, '', '2015', '计算机科学与技术（实验班）', '70', ' 矩阵分析及应用', '  专业必修（限选）', '1', '16', '', '', '', '', ''),
(51, '', '2015', '计算机科学与技术（实验班）', '70', ' 面向对象程序设计', '  学科必修', '3', '48', '', '18', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `user_department_head`
--

CREATE TABLE IF NOT EXISTS `user_department_head` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_department_head`
--

INSERT INTO `user_department_head` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`) VALUES
('110120', '110120', '邓超', '男', '45', '软件', '2312', 'jjj');

-- --------------------------------------------------------

--
-- 表的结构 `user_teacher`
--

CREATE TABLE IF NOT EXISTS `user_teacher` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(5) COLLATE utf8_unicode_ci NOT NULL,
  `birthday` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `department` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teacher`
--

INSERT INTO `user_teacher` (`workNumber`, `password`, `name`, `sex`, `birthday`, `department`, `telephone`, `email`) VALUES
('00001', '00001', '弯毓顺', '女', '教师', '聚少离多', '觉得', '所经历的');

-- --------------------------------------------------------

--
-- 表的结构 `user_teaching_office`
--

CREATE TABLE IF NOT EXISTS `user_teaching_office` (
  `workNumber` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `telephone` varchar(11) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`workNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `user_teaching_office`
--

INSERT INTO `user_teaching_office` (`workNumber`, `password`, `name`, `telephone`, `email`) VALUES
('10044', '10044', '弯毓顺', '111', '222');

--
-- 限制导出的表
--

--
-- 限制表 `department_head_majors`
--
ALTER TABLE `department_head_majors`
  ADD CONSTRAINT `department_head_majors_ibfk_1` FOREIGN KEY (`workNumber`) REFERENCES `user_department_head` (`workNumber`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
